In [4]:
import pandas as pd
from sklearn import preprocessing
from sklearn.preprocessing import OrdinalEncoder, LabelEncoder, OneHotEncoder

ds = pd.read_csv(r'higher_ed_employee_salaries.csv', sep=',')

ds.head(5)

,Name,School,Job Description,Department,Earnings,Year
0,Don Potter,University of Akron,Assistant Lecturer,Social Work,2472.00,2019
1,Emily Potter,The Ohio State University,Administrative Assistant 3,Arts and Sciences | Chemistry and Biochemistry...,48538.02,2022
2,Carol Jean Potter,The Ohio State University,Associate Professor-Clinical,Pediatrics,22722.80,2013
3,Kim Potter,The Ohio State University,"Manager 4, Compliance",Legal Affairs | Compliance,170143.44,2022
4,Graham Potter,Miami University,Building and Grounds Assistant,"Assoc VP Housing,Dining,Rec,Bus Svc",3075.20,2012

Просто хэд датасета

In [11]:
ordEnc = OrdinalEncoder()
ds.loc[:, 'School'] = ordEnc.fit_transform(ds.loc[:, 'School'].to_frame())

ds.head(5)

,Name,School,Job Description,Department,Earnings,Year
0,Don Potter,9.0,Assistant Lecturer,Social Work,2472.00,2019
1,Emily Potter,7.0,Administrative Assistant 3,Arts and Sciences | Chemistry and Biochemistry...,48538.02,2022
2,Carol Jean Potter,7.0,Associate Professor-Clinical,Pediatrics,22722.80,2013
3,Kim Potter,7.0,"Manager 4, Compliance",Legal Affairs | Compliance,170143.44,2022
4,Graham Potter,4.0,Building and Grounds Assistant,"Assoc VP Housing,Dining,Rec,Bus Svc",3075.20,2012

Вообще этот метод используется для с порядковыми котегориальными данными, например, при расставлении уровня образования по учебным заведениям, но найти подходящий датасет сложно, по этому раскидаю школы, как бы по их уровню

In [13]:
labelencoder = LabelEncoder()
 
ds.loc[:, 'Year'] = labelencoder.fit_transform(ds.loc[:, 'Year'])
ds.head(5)

,Name,School,Job Description,Department,Earnings,Year
0,Don Potter,University of Akron,Assistant Lecturer,Social Work,2472.00,8
1,Emily Potter,The Ohio State University,Administrative Assistant 3,Arts and Sciences | Chemistry and Biochemistry...,48538.02,11
2,Carol Jean Potter,The Ohio State University,Associate Professor-Clinical,Pediatrics,22722.80,2
3,Kim Potter,The Ohio State University,"Manager 4, Compliance",Legal Affairs | Compliance,170143.44,11
4,Graham Potter,Miami University,Building and Grounds Assistant,"Assoc VP Housing,Dining,Rec,Bus Svc",3075.20,1

Опять же не по базе использую, но допустим год в нашем случае это псевдо бинарный признак

In [25]:
onehot_encoder = OneHotEncoder(sparse_output=False)
 
encoded_df = pd.DataFrame(onehot_encoder.fit_transform(ds[['School']]))
encoded_df.head(5)

    0    1    2    3    4    5    6    7    8    9    10   11   12
0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

Хотел сделать на другом поле, но он переполнял буффер. По этому разбрасал по школам, что бы бинарно, кто где учился

In [17]:
df = pd.read_csv(r'2021_Vans_Raw.csv', sep=',')
df.rename(columns={'Total fuel consumed (lifetime) (l)': 'TFC_L', 'Total distance travelled (lifetime) (km)': 'TDT_KM'}, inplace=True)
df = df.loc[df['TFC_L'] != 'OEM']
df = df.loc[df['TDT_KM'] != 'OEM']
df.head(5)

,OBFCM data source,ID,OBFCM ReportingPeriod,Registration Year,TFC_L,TDT_KM,Total distance travelled in charge depleting operation with engine off (lifetime) (km),Total distance travelled in charge depleting operation with engine running (lifetime) (km),Total distance travelled in driver-selectable charge increasing operation (lifetime) (km),Total fuel consumed in charge depleting operation (lifetime) (l),Total fuel consumed in driver-selectable charge increasing operation (lifetime) (l),Total grid energy into the battery (lifetime) (kWh),Used in calculation
0,OEM,5765924,2021,2021,302.89,5116.0,NaN,NaN,NaN,NaN,NaN,NaN,1
1,OEM,5766790,2021,2021,233.31,3525.7,NaN,NaN,NaN,NaN,NaN,NaN,1
2,OEM,8407539,2021,2021,683.79,10267.4,NaN,NaN,NaN,NaN,NaN,NaN,1
3,OEM,8407565,2021,2021,1300.49,17753.3,NaN,NaN,NaN,NaN,NaN,NaN,1
4,OEM,8407505,2021,2021,1157.96,15453.3,NaN,NaN,NaN,NaN,NaN,NaN,1

Новый датасет на машинках, для наглядности нормализации

In [19]:
scaler = preprocessing.StandardScaler()
standard_df = scaler.fit_transform(df[['TDT_KM', 'TFC_L']])
standard_df = pd.DataFrame(standard_df)

standard_df

              0         1
0     -0.187300 -0.294264
1     -0.309232 -0.377519
2      0.207667  0.161498
3      0.781625  0.899404
4      0.605280  0.728861
...         ...       ...
12296 -0.578679 -0.654769
12297 -0.578664 -0.655009
12298 -0.578771 -0.653788
12299 -0.579024 -0.654745
12300 -0.578825 -0.654697

[12301 rows x 2 columns]

Вот таким не хитрым образом я привёл все свои значения к еденичной дисперсии, где стандартное отклонение равно 1

In [23]:
scaler = preprocessing.MinMaxScaler()
minmax_df = scaler.fit_transform(df[['TDT_KM', 'TFC_L']])
minmax_df = pd.DataFrame(minmax_df)
minmax_df

              0         1
0      0.012464  0.028329
1      0.008590  0.021822
2      0.025014  0.063955
3      0.043252  0.121635
4      0.037649  0.108304
...         ...       ...
12296  0.000028  0.000150
12297  0.000028  0.000131
12298  0.000025  0.000226
12299  0.000017  0.000152
12300  0.000023  0.000155

[12301 rows x 2 columns]

А сейчас я как бы уменьшил маштаб данных, не меняя сути, собственно это всё что делает метод

In [24]:
scaler = preprocessing.Normalizer()
norm = scaler.fit_transform(df[['TDT_KM', 'TFC_L']])
norm = pd.DataFrame(minmax_df)

norm

              0         1
0      0.012464  0.028329
1      0.008590  0.021822
2      0.025014  0.063955
3      0.043252  0.121635
4      0.037649  0.108304
...         ...       ...
12296  0.000028  0.000150
12297  0.000028  0.000131
12298  0.000025  0.000226
12299  0.000017  0.000152
12300  0.000023  0.000155

[12301 rows x 2 columns]

Нуууу, он как бы тоже делает нормализацию, вот только работает по смтрокам преобразуя значения в диапозон от -1 до 1